app/controllers/items_controller.rb

INSERT INTO "items" ("name", "created_at", "updated_at") VALUES(NULL, '2009-08-04 17:42:10', '2009-08-04 17:42:10')
---
  def create
    @item = Item.new(params[:item])
    if @item.save

SELECT * FROM "items"
---
  def index
    @items = Item.all

SELECT * FROM "items" WHERE ("items"."id" = 7)
DELETE FROM "items" WHERE "id" = 7
---
  def destroy
    @item = Item.find(params[:id])
    @item.destroy