app/controllers/users_controller.rb

  def create
    @user = User.new(params[:user])
    if @user.save
---
INSERT INTO "users" ("single_access_token", "last_request_at", "created_at", "crypted_password", "perishable_token", "updated_at", "failed_login_count", "current_login_ip", "password_salt", "current_login_at", "persistence_token", "login_count", "last_login_ip", "login", "last_login_at", "email") VALUES('ZHsaPQAaxlwuYB0_kXDr', '2009-07-31 11:35:23', '2009-07-31 11:35:23', 'edac337a2c8690848dd509f12238dc9363d1154f379d9ba237eb7f38ed3c7204fb39c8f428fa520cb2dca27a55cf948721924c380d2375461fb6430ab22a44c2', 'P6XTVnoYLM77K9sBWGw7', '2009-07-31 11:35:23', 0, '127.0.0.1', 'kXzYylyZqHhtWrGqTpzz', '2009-07-31 11:35:23', '9094eb9bcca77b30d91b7d106daaafa002244b5e946a96b17b32c67f6b1ae302196e7eaae1a5578f7f572e922523b166db818ecc96c959a4c370361a8101e298', 1, NULL, 'arun', NULL, 'arun@test.com')